Revit 2027 API
PropertySetElement.SetStructuralAsset Method
 Sets a copy of the given StucturalAsset to be used in the PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStructuralAsset(
	StructuralAsset structuralAsset
)
Public Sub SetStructuralAsset (
	structuralAsset As StructuralAsset
)
public:
void SetStructuralAsset(
	StructuralAsset^ structuralAsset
)
member SetStructuralAsset :
        structuralAsset : StructuralAsset -> unit
Parameters
structuralAsset StructuralAsset
Exceptions
Exception | Condition
ArgumentException |  Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PropertySetElement Class
Autodesk.Revit.DB Namespace